
const NUM_POTHOS = 41

 const bodyItem = document.querySelector("body");
 const h1Item = document.querySelector("h1");
 const h5Item = document.querySelector("h5");
 
 console.log(bodyItem);
 const quotes = [
    {
        quote: "הדרך היחידה לעשות עבודה נהדרת היא לאהוב את מה שאתה עושה.",
        said: "סטיב ג'ובס"
    },
    {
        quote: "תאמין שאתה יכול ואתה באמצע הדרך.",
        said: "תיאודור רוזוולט"
    },
    {
        quote: "ההצלחה אינה סופית, כישלון אינו קטלני: האומץ להמשיך הוא שקובע.",
        said: "ווינסטון צ'רצ'יל"
    },
    {
        quote: "באמצע כל קושי שוכנת ההזדמנות.",
        said: "אלברט איינשטיין"
    },
    {
        quote: "העתיד תלוי במה שאתה עושה היום.",
        said: "מהטמה גנדי"
    },
    {
        quote: "אל תסתכל על השעון, תעשה מה שהוא עושה. תמשיך הלאה.",
        said: "סם לבנסון"
    },
    {
        quote: "אתה מפספס 100% מהזריקות שאתה לא לוקח.",
        said: "וויין גרצקי"
    },
    {
        quote: "זה תמיד נראה בלתי אפשרי עד שזה נעשה.",
        said: "נלסון מנדלה"
    },
    {
        quote: "הסוד של להתקדם הוא להתחיל.",
        said: "מארק טווין"
    },
    {
        quote: "הזמן שלך מוגבל, אל תבזבז אותו בלחיות חיים של מישהו אחר.",
        said: "סטיב ג'ובס"
    },
    {
        quote: "אפשר תמיד למצוא נקודת נגיעה בין שני אנשים.",
        said: "ז'וז'ה לואיס בורטרס"
    },
    {
        quote: "ההצלחה היא מסע, לא יעד.",
        said: "בנג'מין מייסון"
    },
    {
        quote: "מה שאין בהתחלה, לא יהיה בסופו.",
        said: "יהודה הלוי"
    },
    {
        quote: "היכולת היא לא מספיקה באמת, עליך לחלום את הפרות.",
        said: "ויטו אלג'ירי"
    },
    {
        quote: "האנשים עם יעוצה גדולה ידברו על רעיון. האנשים עם יעוצה קטנה ידברו על אנשים.",
        said: "אלברט איינשטיין"
    },
    {
        quote: "ללמוד הוא להחכים, אך ללמד אחרים הוא להצטער.",
        said: "קונפוציוס"
    },
    {
        quote: "אין מה לעשות, הדבר החשוב הוא לצחוק על עצמך.",
        said: "צ'ארלי בראון"
    },
    {
        quote: "אל תגביר את מהירות, שפשוט תכווץ מה שאינך צריך.",
        said: "פייד דומז"
    },
    {
        quote: "בחיים יש אינספור דברים שטובים יותר מכשירת הרמוניה.",
        said: "דיויד ווקר"
    },
    {
        quote: "החלומות הם כמו הכוכבים. אתה יכול לראות אותם, אך אין אפשרות להפגין אותם.",
        said: "ליון הריסון"
    },
    {
        quote: "חייבים לשכוח מה שמביאים לנו למעשה עשיה גרועה.",
        said: "אנטואן דה סנט-אכזופרי"
    },
    {
        quote: "אם אתה יכול לחלום את זה, אתה יכול לעשות את זה.",
        said: "וויליאם קנט"
    },
    {
        quote: "החינוך הוא אינספור קרקעות, והכלים הם הפרצופים שנחשפים לשמש.",
        said: "גידי רז"
    },
    {
        quote: "גדלים לא בגיל, אלא ברגעים.",
        said: "אנטואן דה סנט-אכזופרי"
    },
    {
        quote: "ההצלחה היא לא מקרה. היא מורכבת מאחוזים.",
        said: "דניאל פסקל"
    },
    {
        quote: "כשאתה מסתכל בחזית האופטימיסט מכך שנקלעת להיות הפסימיסט.",
        said: "ג'יימס קאבל"
    },
    {
        quote: "אם אתה לא בונה את החלומות שלך, אז תסכים לעזוב את החלומות שלך.",
        said: "רקיה"
    },
    {
        quote: "בסוף, אנחנו זוכרים לא את המילים של אויבינו, אלא את הדמעות של ידידינו.",
        said: "מרטין לותר קינג"
    },
    {
        quote: "אל תגיד שלא ניסית. אל תפסיק לנסות.",
        said: "מייקל ג'ורדן"
    },
    {
        quote: "בשביל להצליח, צריך להיות מפוצץ באנרגיה חיובית.",
        said: "מורן אטיאס"
    },
    {
        quote: "הצלחה היא לא מקרה, הצלחה היא תוצאה.",
        said: "ג'ון פוקס"
    },
    {
        quote: "הבדידות היא המחילה של הזמן, על אנשים לשוב זמן רב ולאהוב בבית.",
        said: "אלכסנדר דומאס"
    },
    {
        quote: "לא פעם כשפתאום עומדים בפני בחירה, אנחנו כל כך מבולבלים שנשארים במקום.",
        said: "הרמן הסה"
    },
    {
        quote: "אם נראה נורמלי, אנחנו נצליח בלבוש נורמלי.",
        said: "ג'יקס"
    },
    {
        quote: "האנשים שלא יכולים לעשות דברים גדולים תמיד יושבים ומדברים על אנשים שעשו דברים גדולים.",
        said: "טנה סוביץ'"
    },
    {
        quote: "אל תחפשו את האיש המושלם. תמצאו את האיש שמשתגע עבורכם.",
        said: "אנדי רופ"
    },
    {
        quote: "העיקר הוא לשחק, אך בשביל לשחק עליך לפרק את החוקים.",
        said: "דיוויד בוחנון"
    },
    {
        quote: "האמון בכך שיש פתרון הוא הדרך למצוא אותו.",
        said: "מוחמד אלי"
    },
    {
        quote: "הפועל היא אבא של החשמל.",
        said: "טומס אדיסון"
    },
    {
        quote: "אם אתה רוצה ללמוד איך לטס, תצטרך להתפזר מהקרקע.",
        said: "דלאי למה"
    },
    {
        quote: "הגבורה היא לא אין פחד, אלא להתגבר עליו.",
        said: "נלסון מנדלה"
    },
    {
        quote: "אל תשנה את מה שאתה יודע כדי לתמוך באחרים. שנה את מה שאתה יודע כדי להשתפר.",
        said: "אינרג'י"
    },
    {
        quote: "הקשיים שאתה פוגש אומצים אותך למעלה.",
        said: "אריק תומס"
    },
    {
        quote: "המטרה היא לחיות חיים רגילים, ולא לחיות את הגיל שלך.",
        said: "כרמן אליאס"
    },
    {
        quote: "החיים הם לא מה שאתה מוצא, אלא מה שאתה יוצר.",
        said: "בוב מרלי"
    },
    {
        quote: "אם אתה לא יודע לאן אתה הולך, תסתכל איזה מסילה אתה נכנס.",
        said: "וויל רוג'רס"
    },
    {
        quote: "לא לכל אחד מאיתנו הוא נתן כמה זמן. זה לא אותו דבר כמו לאהוב.",
        said: "ג'ימי באפט"
    },
    {
        quote: "את ההצלחה אפשר לא מדוד, עם סרט מדידה, ולא ממשקל.",
        said: "מואיז'י"
    },
    {
        quote: "אפשר להשתמש בכל דקת זמן להעשות טוב.",
        said: "סנט אלברט"
    },
    {
        quote: "כשאתה קונה משהו ממישהו, אתה לא משלם רק בכסף. אתה משלם גם בזמן שלך.",
        said: "סטיב ג'ובס"
    },
    {
        quote: "מה שאתה אמור לעשות כדי להצליח, זה מה שהאחרים מצפים ממך לעשות.",
        said: "בריאן טרייסי"
    },
    {
        quote: "אין לי אמון בהצלחה בלעדי עבודה קשה.",
        said: "סיר אל מגוויר"
    },
    {
        quote: "בעזרת הפרצוף קל לכרות מעשה טוב.",
        said: "אפרים קישון"
    },
    {
        quote: "הפועל הוא פרה מול עגל, השני תמיד חוטף את השני.",
        said: "אלברט איינשטיין"
    },
    {
        quote: "אל תגדל על השגיאות, גדל על התיקונים שלך.",
        said: "דטנה פיסטו"
    },
    {
        quote: "אם אתה לא יודע איפה אתה הולך, כל הדרכים כדאי שתלך בהם.",
        said: "להברה"
    },
    {
        quote: "כדי לשנות את העולם, עליך להשתנות ראשית.",
        said: "נלסון מנדלה"
    },
    {
        quote: "כשאתה עושה דברים באהבה, אתה מפרגן לטבע שנתן לך לעשות אותם.",
        said: "מישל אובמה"
    },
    {
        quote: "אתה לא מפסיק לשחק מכיוון שאתה מזז את העיניים, אלא מזיז את העיניים מכיוון שאתה מפסיק לשחק.",
        said: "הרמן הסה"
    },
    {
        quote: "הכשלון הוא לא אפשרות. ההפסד הוא רק הכדור הראשון.",
        said: "וסילי"
    },
    {
        quote: "אל תפחד להיבחן מחדש, כי כל פעם שאתה עובר כושר, הוא נשאר איתך.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "המחשבה היא הנשק החזק ביותר שיש לך.",
        said: "מת'יו קליפ"
    },
    {
        quote: "כשתמיד אתה עושה את מה שאתה יכול, אתה מוצא את האמונה בעצמך.",
        said: "ג'יימס פריז"
    },
    {
        quote: "אל תחפש את האדם הכושל, תחפש את האדם שניסה שוב.",
        said: "ג'יימס אלן"
    },
    {
        quote: "בחיים יש רק דווקא. אפשר גם לא להתחיל אם אתה לא רוצה.",
        said: "פרדריק ניטשה"
    },
    {
        quote: "לא תמיד זוכים, אך לא תמיד מפסידים.",
        said: "פרספוליס"
    },
    {
        quote: "העיקר הוא לצחוק על עצמך. זו החכמה הגדולה.",
        said: "צ'ארלי צ'פלין"
    },
    {
        quote: "בחיים, תמיד יש מקום לשיפור.",
        said: "שקספיר"
    },
    {
        quote: "בשביל לשנות את העולם, אתה צריך לשנות את עצמך.",
        said: "מהטמה גנדי"
    },
    {
        quote:" .החוכמה האמיתית היחידה היא בידיעה שאינך יודע דבר" ,
        said: "סוקראטס"
    },
    {
        quote: "אל תפחד לגשת ולסגור דלתות, או אפילו לפתוח אחת.",
        said: "וויליאם מקנלי"
    },
    {
        quote: "העיקר הוא לא להפסיק לשאול שאלות.",
        said: "אלברט איינשטיין"
    },
    {
        quote: "אין לי אידיאולוגיה, יש לי גוף פעיל.",
        said: "מישל אובמה"
    },
    {
        quote: "הדבר הכי חשוב הוא להבין שיש לך מה ללמוד.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "בלעדי חלומות, חיים לא שווים כלום.",
        said: "ביל ראש"
    },
    {
        quote: "ברור שאנשים טובים עוזרים לנו לבלות זמן, אך אנשים נכונים עוזרים לנו לעבור את הזמן.",
        said: "מארק טווין"
    },
    {
        quote: "היכולת לשאול שאלות היא חשובה יותר מהיכולת לתת תשובות.",
        said: "ר' אלברט איינשטיין"
    },
    {
        quote: "אתה רואה דברים ואומר 'למה?'. אבל אני חולמת דברים שאילו לא היו, הייתי אומרת 'למה לא?'",
        said: "ג'ורג' ברנרד שואו"
    },
    {
        quote: "בסוף, אנחנו לא זוכרים את המילים של אויבינו, אלא את הדמעות של ידידינו.",
        said: "מרטין לותר קינג"
    },
    {
        quote: "הפועל הוא פרה מול עגל, השני תמיד חוטף את השני.",
        said: "אלברט איינשטיין"
    },
    {
        quote: "כשאתה רוצה משהו, כל היקום מזוין בכדי להקשיב לך.",
        said: "פאולו קואליו"
    },
    {
        quote: "במקום להתאמץ למצוא חבר מושלם, תשתדל להיות חבר מושלם.",
        said: "ג'סטין טימברלייק"
    },
    {
        quote: "האם אני לא אני אם אני מסתמך על אחרים?",
        said: "קונדורסה"
    },
    {
        quote: "אל תפסיק ללמוד משום שגילך הוא גבוה. גם כדי לזרום, יש ללמוד תחילה.",
        said: "ג'ימי ג'ונס"
    },
    {
        quote: "החיים הם לא מה שאתה מוצא, אלא מה שאתה יוצר.",
        said: "בוב מרלי"
    },
    {
        quote: "החיים קצרים מכדי להסתבך ולהיות מיואש",
        said: "ביל בריאנט"
    },
    {
        quote: "כשאנחנו אומרים שאי אפשר להשיג את זה, זה לא יכול להיעשות",
        said: "ביל בריאנט"
    },
    {
        quote: "לא לכל אחד מאיתנו הוא נתן כמה זמן. זה לא אותו דבר כמו לאהוב.",
        said: "ג'ימי באפט"
    },
    {
        quote: "אל תגביר את המהירות, שפשוט תכווץ מה שאינך צריך.",
        said: "פייד דומז"
    },
    {
        quote: "בעזרת הפרצוף קל לכרות מעשה טוב.",
        said: "אפרים קישון"
    },
    {
        quote: "בחיים, תמיד יש מקום לשיפור.",
        said: "שקספיר"
    },
    {
        quote: "בשביל לשנות את העולם, אתה צריך לשנות את עצמך.",
        said: "מהטמה גנדי"
    },
    {
        quote: "השולי הוא המקום הבטוב לנפוש.",
        said: "סוקראטס"
    },
    {
        quote: "בלעדי חלומות, חיים לא שווים כלום.",
        said: "ביל ראש"
    },
    {
        quote: "ברור שאנשים טובים עוזרים לנו לבלות זמן, אך אנשים נכונים עוזרים לנו לעבור את הזמן.",
        said: "מארק טווין"
    },
    {
        quote: "היכולת לשאול שאלות היא חשובה יותר מהיכולת לתת תשובות.",
        said: "ר' אלברט איינשטיין"
    },
    {
        quote: "אין לי אידיאולוגיה, יש לי גוף פעיל.",
        said: "מישל אובמה"
    },
    {
        quote: "הדבר הכי חשוב הוא להבין שיש לך מה ללמוד.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "בלעדי חלומות, חיים לא שווים כלום.",
        said: "ביל ראש"
    },
    {
        quote: "ברור שאנשים טובים עוזרים לנו לבלות זמן, אך אנשים נכונים עוזרים לנו לעבור את הזמן.",
        said: "מארק טווין"
    },
    {
        quote: "היכולת לשאול שאלות היא חשובה יותר מהיכולת לתת תשובות.",
        said: "ר' אלברט איינשטיין"
    },
    {
        quote: "אין לי אידיאולוגיה, יש לי גוף פעיל.",
        said: "מישל אובמה"
    },
    {
        quote: "הדבר הכי חשוב הוא להבין שיש לך מה ללמוד.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "כשאתה עושה דברים באהבה, אתה מפרגן לטבע שנתן לך לעשות אותם.",
        said: "מישל אובמה"
    },
    {
        quote: "אתה לא מפסיק לשחק מכיוון שאתה מזז את העיניים, אלא מזיז את העיניים מכיוון שאתה מפסיק לשחק.",
        said: "הרמן הסה"
    },
    {
        quote: "הכשלון הוא לא אפשרות. ההפסד הוא רק הכדור הראשון.",
        said: "וסילי"
    },
    {
        quote: "אל תפחד להיבחן מחדש, כי כל פעם שאתה עובר כושר, הוא נשאר איתך.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "המחשבה היא הנשק החזק ביותר שיש לך.",
        said: "מת'יו קליפ"
    },
    {
        quote: "כשתמיד אתה עושה את מה שאתה יכול, אתה מוצא את האמונה בעצמך.",
        said: "ג'יימס פריז"
    },
    {
        quote: "לא לכל אחד מאיתנו הוא נתן כמה זמן. זה לא אותו דבר כמו לאהוב.",
        said: "ג'ימי באפט"
    },
    {
        quote: "אל תגביר את המהירות, שפשוט תכווץ מה שאינך צריך.",
        said: "פייד דומז"
    },
    {
        quote: "בחיים, תמיד יש מקום לשיפור.",
        said: "שקספיר"
    },
    {
        quote: "בשביל לשנות את העולם, אתה צריך לשנות את עצמך.",
        said: "מהטמה גנדי"
    },
    {
        quote: "השולי הוא המקום הבטוב לנפוש.",
        said: "סוקראטס"
    },
    {
        quote: "בלעדי חלומות, חיים לא שווים כלום.",
        said: "ביל ראש"
    },
    {
        quote: "ברור שאנשים טובים עוזרים לנו לבלות זמן, אך אנשים נכונים עוזרים לנו לעבור את הזמן.",
        said: "מארק טווין"
    },
    {
        quote: "היכולת לשאול שאלות היא חשובה יותר מהיכולת לתת תשובות.",
        said: "ר' אלברט איינשטיין"
    },
    {
        quote: "אין לי אידיאולוגיה, יש לי גוף פעיל.",
        said: "מישל אובמה"
    },
    {
        quote: "הדבר הכי חשוב הוא להבין שיש לך מה ללמוד.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "כשאתה עושה דברים באהבה, אתה מפרגן לטבע שנתן לך לעשות אותם.",
        said: "מישל אובמה"
    },
    {
        quote: "אתה לא מפסיק לשחק מכיוון שאתה מזז את העיניים, אלא מזיז את העיניים מכיוון שאתה מפסיק לשחק.",
        said: "הרמן הסה"
    },
    {
        quote: "הכשלון הוא לא אפשרות. ההפסד הוא רק הכדור הראשון.",
        said: "וסילי"
    },
    {
        quote: "אל תפחד להיבחן מחדש, כי כל פעם שאתה עובר כושר, הוא נשאר איתך.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "המחשבה היא הנשק החזק ביותר שיש לך.",
        said: "מת'יו קליפ"
    },
    {
        quote: "כשתמיד אתה עושה את מה שאתה יכול, אתה מוצא את האמונה בעצמך.",
        said: "ג'יימס פריז"
    },
    { quote: "הרעיון של הצלחה הוא חופש אישי.", said: "אדית וורטון" },
    { quote: "ההצלחה מתוקה ביותר בעבור מי שלא הצליח מעולם.", said: "אמילי דיקינסון" },
    { quote: "ההצלחה אינה נמדדת בשניות או בדקות, היא נמדדת בשנים ארוכות.", said: "ריקרדו סמלר" },
    { quote: "הצלחה פירושה שיהיה לך אפשרות לעשות מה שאתה רוצה.", said: "לאונטין פרייס" },
    { quote: "הצלחה משמעה ללכת ממפלה למפלה בלי לאבד את ההתלהבות.", said: "וינסטון צ'רצ'יל" },
    { quote: "לכל איש תאיר ההצלחה פניה פעם אחת בחייו, אך המאֻשר יראה אותה ויחזיק בה.", said: "פרץ סמולנסקין" },
    { quote: "אני כה מוג לב עד כי אינני מודד את ההצלחה על פי מעמד רם ונישא, אלא על פי נוחיותי בלבד.", said: "מישל דה מונטן" },
    { quote: "מעולם לא חשבתי על הצלחה במושגים של תהילה וכסף. הכשרון והתשוקה הם ההצלחה.", said: "אינגריד ברגמן" },
    { quote: "ההתכנסות יחד היא התחלה. ההישארות יחדיו היא התקדמות. העבודה יחד היא הצלחה.", said: "הנרי פורד" },
    { quote: "לפני שמנצחים נוחלים תבוסות רבות.", said: "דנג מינג דאו, \"טאו לכל יום\"" },
    { quote: "המונח הצלחה מוגדר על ידי כל אחד באופן אישי וסובייקטיבי. הצלחה תלויה במערכת הציפיות הייחודית שלנו, בהשפעות שונות כמו השפעות חברתיות, בהשוואתן למציאות ובמידת מימושן.", said: "בלה בלייכר ולביא סיגמן, \"משחקי הכוחות\"" },
    { quote: "הצלחה מורכבת מאחוז אחד של השראה ותשעים ותשעה אחוזים של הזעה.", said: "תומאס אלווה אדיסון" },
    { quote: "איך להצליח?\n\"מרשם להצלחה: לך בדרכך.\"", said: "מוזס איסגאוה" },
    { quote: "סוד ההצלחה הוא דבקות במטרה.", said: "בנימין ד'יזראלי" },
    { quote: "אין מעלית להצלחה. תצטרך לקחת את המדרגות.", said: "זיג זיגלר" },
    { quote: "המילון הוא המקום היחיד שבו הצלחה מופיעה לפני עבודה.", said: "וינס לומברדי" },
    { quote: "אדם נמרץ ומצליח הוא מי שעלה בידו להפוך למציאות את הדמיון.", said: "זיגמונד פרויד" },
    { quote: "האמנות להיות פעם מאוד זהיר ופעם מאוד נועז, היא האמנות להצליח.", said: "נפוליון בונפרטה" },
    { quote: "ההצלחה היא תוצאה של הכנה, של עבודה קשה ושל הסקת מסקנות מכישלונות העבר.", said: "קולין פאוול" },
    { quote: "הצלחה היא שילוב של אהבה לדבר שאתה עושה, ידיעה שאין די בכך ושעליך לעבוד קשה ושתהיה לך תחושת מטרה.", said: "מרגרט תאצ'ר" },
    { quote: "האחריות היא מחיר ההצלחה.", said: "וינסטון צ'רצ'יל" },
    { quote: "ההצלחה מהווה את הדרכון הטוב ביותר.", said: "קלוד ללוש" },
    { quote: "הצלחה היא דבר נפלא, אך היא מחייבת להמשיך וללכת בקצב.", said: "צ'רלי צ'פלין" },
    { quote: "הדבר הקשה ביותר בהצלחה הוא למצוא מישהו שיהיה שמח בהצלחתך.", said: "בט מידלר" },
    { quote: "הצלחה היא חטא בלתי נסלח כלפי הזולת.", said: "אמברוז בירס" },
    { quote: "ההצלחה והאדם אינם היינו הך; קשה מאוד להישאר בשיא ההצלחה.", said: "אלביס פרסלי" },
    { quote: "סוד ההצלחה אינו אלא להכיר את אלה שלא הצליחו.", said: "מרסל אשאר" },
    { quote: "להצלחה אבות רבים, הכישלון יתום הוא.", said: "פתגם עממי" },
    { quote: "ההצלחה, במקום לשחררנו, הופכת לסגנון חיינו.", said: "ארתור מילר" },
    { quote: "מההצלחות אתה לא לומד — מההצלחות אתה נהנה. אתה לומד מהמקום שבו לא הצלחת, שנתקלת בקירות.", said: "נתן רביץ" },
    { quote: "להרגיש מוערך, לדעת אפילו מדי פעם שאתה מסוגל לעשות את העבודה כראוי, זו הרגשה נפלאה.", said: "ברברה וולטרס" },
    { quote: "הצלחה יכולה להוביל אותך לשני כיוונים. היא יכולה להפוך אותך לפרימדונה, או, שיכולה להפוך אותך לרכה יותר על ידי כך שהיא מגבירה את הבטחון העצמי וכתוצאה מכך יכולה לתת לדברים הטובים לצאת.", said: "ברברה וולטרס" }
    ,{
        quote: "לא לכל אחד מאיתנו הוא נתן כמה זמן. זה לא אותו דבר כמו לאהוב.",
        said: "ג'ימי באפט"
    },
    {
        quote: "אל תגביר את המהירות, שפשוט תכווץ מה שאינך צריך.",
        said: "פייד דומז"
    },
    {
        quote: "בחיים, תמיד יש מקום לשיפור.",
        said: "שקספיר"
    },
    {
        quote: "בשביל לשנות את העולם, אתה צריך לשנות את עצמך.",
        said: "מהטמה גנדי"
    },
    {
        quote: "השולי הוא המקום הבטוב לנפוש.",
        said: "סוקראטס"
    },
    {
        quote: "בלעדי חלומות, חיים לא שווים כלום.",
        said: "ביל ראש"
    },
    {
        quote: "ברור שאנשים טובים עוזרים לנו לבלות זמן, אך אנשים נכונים עוזרים לנו לעבור את הזמן.",
        said: "מארק טווין"
    },
    {
        quote: "היכולת לשאול שאלות היא חשובה יותר מהיכולת לתת תשובות.",
        said: "ר' אלברט איינשטיין"
    },
    {
        quote: "אין לי אידיאולוגיה, יש לי גוף פעיל.",
        said: "מישל אובמה"
    },
    {
        quote: "הדבר הכי חשוב הוא להבין שיש לך מה ללמוד.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "כשאתה עושה דברים באהבה, אתה מפרגן לטבע שנתן לך לעשות אותם.",
        said: "מישל אובמה"
    },
    {
        quote: "אתה לא מפסיק לשחק מכיוון שאתה מזז את העיניים, אלא מזיז את העיניים מכיוון שאתה מפסיק לשחק.",
        said: "הרמן הסה"
    },
    {
        quote: "הכשלון הוא לא אפשרות. ההפסד הוא רק הכדור הראשון.",
        said: "וסילי"
    },
    {
        quote: "אל תפחד להיבחן מחדש, כי כל פעם שאתה עובר כושר, הוא נשאר איתך.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "המחשבה היא הנשק החזק ביותר שיש לך.",
        said: "מת'יו קליפ"
    },
    {
        quote: "כשתמיד אתה עושה את מה שאתה יכול, אתה מוצא את האמונה בעצמך.",
        said: "ג'יימס פריז"
    },
    {
        quote: "לא לכל אחד מאיתנו הוא נתן כמה זמן. זה לא אותו דבר כמו לאהוב.",
        said: "ג'ימי באפט"
    },
    {
        quote: "אל תגביר את המהירות, שפשוט תכווץ מה שאינך צריך.",
        said: "פייד דומז"
    },
    {
        quote: "בחיים, תמיד יש מקום לשיפור.",
        said: "שקספיר"
    },
    {
        quote: "בשביל לשנות את העולם, אתה צריך לשנות את עצמך.",
        said: "מהטמה גנדי"
    },
    {
        quote: "השולי הוא המקום הבטוב לנפוש.",
        said: "סוקראטס"
    },
    {
        quote: "בלעדי חלומות, חיים לא שווים כלום.",
        said: "ביל ראש"
    },
    {
        quote: "ברור שאנשים טובים עוזרים לנו לבלות זמן, אך אנשים נכונים עוזרים לנו לעבור את הזמן.",
        said: "מארק טווין"
    },
    {
        quote: "היכולת לשאול שאלות היא חשובה יותר מהיכולת לתת תשובות.",
        said: "ר' אלברט איינשטיין"
    },
    {
        quote: "אין לי אידיאולוגיה, יש לי גוף פעיל.",
        said: "מישל אובמה"
    },
    {
        quote: "הדבר הכי חשוב הוא להבין שיש לך מה ללמוד.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "כשאתה עושה דברים באהבה, אתה מפרגן לטבע שנתן לך לעשות אותם.",
        said: "מישל אובמה"
    },
    {
        quote: "אתה לא מפסיק לשחק מכיוון שאתה מזז את העיניים, אלא מזיז את העיניים מכיוון שאתה מפסיק לשחק.",
        said: "הרמן הסה"
    },
    {
        quote: "הכשלון הוא לא אפשרות. ההפסד הוא רק הכדור הראשון.",
        said: "וסילי"
    },
    {
        quote: "אל תפחד להיבחן מחדש, כי כל פעם שאתה עובר כושר, הוא נשאר איתך.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "המחשבה היא הנשק החזק ביותר שיש לך.",
        said: "מת'יו קליפ"
    },
    {
        quote: "כשתמיד אתה עושה את מה שאתה יכול, אתה מוצא את האמונה בעצמך.",
        said: "ג'יימס פריז"
    },
    {
        quote: "לא לכל אחד מאיתנו הוא נתן כמה זמן. זה לא אותו דבר כמו לאהוב.",
        said: "ג'ימי באפט"
    },
    {
        quote: "אל תגביר את המהירות, שפשוט תכווץ מה שאינך צריך.",
        said: "פייד דומז"
    },
    {
        quote: "בחיים, תמיד יש מקום לשיפור.",
        said: "שקספיר"
    },
    {
        quote: "בשביל לשנות את העולם, אתה צריך לשנות את עצמך.",
        said: "מהטמה גנדי"
    },
    {
        quote: "השולי הוא המקום הבטוב לנפוש.",
        said: "סוקראטס"
    },
    {
        quote: "בלעדי חלומות, חיים לא שווים כלום.",
        said: "ביל ראש"
    },
    {
        quote: "ברור שאנשים טובים עוזרים לנו לבלות זמן, אך אנשים נכונים עוזרים לנו לעבור את הזמן.",
        said: "מארק טווין"
    },
    {
        quote: "היכולת לשאול שאלות היא חשובה יותר מהיכולת לתת תשובות.",
        said: "ר' אלברט איינשטיין"
    },
    {
        quote: "אין לי אידיאולוגיה, יש לי גוף פעיל.",
        said: "מישל אובמה"
    },
    {
        quote: "הדבר הכי חשוב הוא להבין שיש לך מה ללמוד.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "כשאתה עושה דברים באהבה, אתה מפרגן לטבע שנתן לך לעשות אותם.",
        said: "מישל אובמה"
    },
    {
        quote: "אתה לא מפסיק לשחק מכיוון שאתה מזז את העיניים, אלא מזיז את העיניים מכיוון שאתה מפסיק לשחק.",
        said: "הרמן הסה"
    },
    {
        quote: "הכשלון הוא לא אפשרות. ההפסד הוא רק הכדור הראשון.",
        said: "וסילי"
    },
    {
        quote: "אל תפחד להיבחן מחדש, כי כל פעם שאתה עובר כושר, הוא נשאר איתך.",
        said: "מאיה אנג'לו"
    },
    {
        quote: "המחשבה היא הנשק החזק ביותר שיש לך.",
        said: "מת'יו קליפ"
    },
    {
        quote: "כשתמיד אתה עושה את מה שאתה יכול, אתה מוצא את האמונה בעצמך.",
        said: "ג'יימס פריז"
    },

    {
        quote: "לא לכל אחד מאיתנו הוא נתן כמה זמן. זה לא אותו דבר כמו لאהוב.",
        said: "ג'ימי באפט"
    },
    {
        quote: "אל תגביר את המהירות, פשוט תאט מה שאינך צריך.",
        said: "פייד דומז"
    }
]
 
const randomImage = Math.floor(Math.random() * NUM_POTHOS) + 1;
const srcImage = `photos/img (${randomImage}).jpg`;
console.log(srcImage + "\nphotos/img (4).jpg");

document.body.style.backgroundImage = `url('${srcImage}')`;
document.body.style.backgroundSize = "cover"; 
document.body.style.backgroundPosition = "center center";
document.body.style.backgroundRepeat = "no-repeat";

const randomquote = Math.floor(Math.random() * quotes.length);
quoteObj = quotes[randomquote]
h1Item.textContent = quoteObj.quote
h5Item.textContent = `- ${quoteObj.said} -`

// Function to calculate contrast color
function getContrastColor(rgbColor) {
  const values = rgbColor.match(/\d+/g);
  const r = parseInt(values[0]);
  const g = parseInt(values[1]);
  const b = parseInt(values[2]);
  const brightness = (r * 299 + g * 587 + b * 114) / 1000;
  return brightness > 128 ? "black" : "white";
}

const canvas = document.createElement('canvas');
canvas.width = window.innerWidth;
canvas.height = window.innerHeight;
const context = canvas.getContext('2d');
const image = new Image();
image.src = srcImage;




image.onload = function() {
  context.drawImage(image, 0, 0, canvas.width, canvas.height);
  const centerX = canvas.width / 2;
  const centerY = canvas.height / 2;
  const pixel = context.getImageData(centerX, centerY, 1, 1).data;
  const rgbColor = `rgb(${pixel[0]}, ${pixel[1]}, ${pixel[2]})`;
  const contrastColor = getContrastColor(rgbColor);

  h1Item.style.color = contrastColor;
  h5Item.style.color = contrastColor;
};